[
  {
    "id": 1,
    "title": "Il est possible de connaître les nouveaux contenus ou services",
    "authors": ["Marco BARONI"],
    "path": "/rules/1",
    "description": "Une image vaut souvent mieux qu’un long discours. Certes, mais tout d’abord, il peut s’avérer difficile de véritablement comprendre un graphique (courbe, diagramme, histogramme, camembert...) si l’on n'a pas les données qui ont permis de le créer. D’autre part, certains utilisateurs ne pourront pas avoir accès au rendu graphique, et l’accès aux données leur permettra de comprendre les contenus.",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "SEO",
      "Écoconception"
    ],
    "objectives": [
      "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
      "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
    ],
    "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
    "implementation": [
      "Publier un flux RSS des actualités du site.",
      "Publier une rubrique du type « Actualités du site » ou « Quoi de neuf ? »",
      "Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site."
    ],
    "control": [
      "Vérifier qu’un canal interne existe (flux RSS, rubrique « Quoi de neuf ? », etc.).",
      "Vérifier qu’un canal externe est accessible depuis la page d’accueil (si utilisé)."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 2,
    "title": "Les informations importantes sont accessibles et compréhensibles",
    "path": "/rules/2",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "UX",
      "SEO"
    ],
    "objective": "Assurer que les informations essentielles sont facilement accessibles et compréhensibles pour tous les utilisateurs, y compris ceux ayant des besoins spécifiques."
  },
  {
    "id": 8,
    "title": "Les contenus publicitaires ou sponsorisés sont identifiés comme tels.",
    "authors": ["Abdulmalek ESUGHI"],
    "path": "/rules/8",
    "description": "Contenu éditorial ou publicitaire ? Article de fond ou publireportage ? Avis impartial ou billet sponsorisé ? Mieux vaut préciser de quoi il s'agit, ainsi les internautes sauront à quoi s'en tenir et n'auront rien à vous reprocher.",
    "tags": ["Conception", "Contenus", "Editorial", "SEO", "Écoconception"],
    "objectives": [
      "Permettre aux utilisateurs d'identifier les contenus publicitaires et sponsorisés.",
      "Respecter les règles de transparence et de confiance envers les utilisateurs."
    ],
    "implementationIntro": "Identifier clairement tout contenu publicitaire ou sponsorisé.",
    "implementation": [
      "Ajouter une mention explicite « Publicité » ou « Sponsorisé » avant le contenu",
      "Utiliser une mise en page ou une couleur différente pour les contenus publicitaires",
      "Inclure une mention légale précisant la nature publicitaire du contenu"
    ],
    "control": [
      "Vérifier que tout contenu publicitaire porte une mention explicite.",
      "Vérifier que les utilisateurs peuvent facilement identifier les contenus sponsorisés."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 9,
    "title": "Les conditions de modération des espaces publics sont indiquées.",
    "path": "/rules/9",
    "authors": ["Abdulmalek ESUGHI"],
    "tags": ["Contenus", "Editorial"],
    "objectives": [
      "Informer les utilisateurs des règles de modération des espaces publics.",
      "Assurer la transparence concernant les contenus autorisés et interdits."
    ],
    "implementationIntro": "Afficher clairement les conditions de modération des espaces publics.",
    "implementation": [
      "Publier les conditions de modération de manière visible",
      "Indiquer quels types de contenus sont autorisés ou interdits",
      "Expliquer les conséquences du non-respect des règles"
    ],
    "control": [
      "Vérifier la présence de conditions de modération dans les espaces publics.",
      "Vérifier que les conditions sont faciles à trouver et à comprendre."
    ],
    "screenshotsSources": ["", "", ""]
  },
  {
    "id": 10,
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "authors": ["Abdulmalek ESUGHI"],
    "path": "/rules/10",
    "description": "Il est fort agaçant de voir publier un message sous une forme dégradée ou de constater après envoi que l’on a écrit une grosse bêtise. La prévisualisation permet de voir les contenus en contexte et donne la possibilité de les corriger ou de les peaufiner.",
    "tags": ["Contenus", "Développement"],
    "objectives": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
      "Diminuer le nombre de demandes de rectification ou de suppression."
    ],
    "implementationIntro": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
    "implementation": [
      "Afficher un aperçu du contenu avant publication",
      "Permettre la modification du contenu en prévisualisation",
      "Ajouter un bouton de confirmation final"
    ],
    "control": [
      "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :",
      "Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.",
      "Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    ],
    "screenshotsSources": ["", "", ""]
  },
  {
    "id": 11,
    "title": "Les espaces publics proposent au moins un moyen de signaler les abus.",
    "path": "/rules/11",
    "authors": ["Abdulmalek ESUGHI"],
    "tags": ["Conception", "Contenus"],
    "objectives": [
      "Permettre aux utilisateurs de signaler les contenus abusifs ou inappropriés.",
      "Assurer une modération efficace des espaces publics."
    ],
    "implementationIntro": "Mettre en place un système de signalement des abus dans les espaces publics.",
    "implementation": [
      "Ajouter un bouton ou un lien « Signaler » visible sur chaque contenu",
      "Mettre en place un formulaire simple pour signaler les abus",
      "Définir une procédure de traitement des signalements"
    ],
    "control": [
      "Vérifier la présence d'un moyen de signaler les abus dans les espaces publics.",
      "Vérifier que ce moyen est facilement accessible et fonctionnel."
    ],
    "screenshotsSources": ["", "", ""]
  },
  {
    "id": 12,
    "title": "Chaque graphique est accompagné de ses données numériques.",
    "path": "/rules/12",
    "authors": ["Abdulmalek ESUGHI"],
    "tags": ["Accessibilité", "Conception", "Contenus", "Editorial", "SEO"],
    "objectives": [
      "Rendre les graphiques accessibles à tous les utilisateurs.",
      "Permettre la réutilisation et la vérification des données."
    ],
    "implementationIntro": "Accompagner chaque graphique de ses données numériques source.",
    "implementation": [
      "Afficher un tableau de données numériques avec le graphique",
      "Fournir un lien de téléchargement des données",
      "Ajouter une description textuelle du graphique"
    ],
    "control": [
      "Vérifier que chaque graphique dispose de ses données numériques.",
      "Vérifier que les utilisateurs peuvent accéder aux données même sans affichage graphique."
    ],
    "screenshotsSources": ["", "", ""]
  },
  {
    "id": 13,
    "title": "La page des résultats de recherche indique le nombre de résultats, le nombre de pages de résultats, et le nombre de résultats par page.",
    "path": "/rules/13",
    "authors": ["Abdulmalek ESUGHI"],
    "tags": ["Conception", "Contenus", "Développement"],
    "objectives": [
      "Aider l'utilisateur à évaluer rapidement le volume de résultats.",
      "Permettre une navigation efficace dans les résultats de recherche."
    ],
    "implementationIntro": "Afficher clairement les informations de pagination sur la page de résultats.",
    "implementation": [
      "Afficher le nombre total de résultats trouvés",
      "Indiquer le nombre de pages disponibles",
      "Afficher le nombre de résultats affichés par page",
      "Permettre de modifier le nombre de résultats par page"
    ],
    "control": [
      "Effectuer une recherche sur le site.",
      "Vérifier que le nombre total de résultats est affiché.",
      "Vérifier que le nombre de pages est indiqué.",
      "Vérifier que le nombre de résultats par page est visible."
    ],
    "screenshotsSources": ["", "", ""]
  },
  {
    "id": 14,
    "title": "Les contenus ne détournent pas de caractères pour simuler une mise en forme visuelle.",
    "path": "/rules/14",
    "authors": ["Abdulmalek ESUGHI"],
    "tags": ["Accessibilité", "Contenus", "Editorial", "SEO"],
    "objectives": [
      "Assurer l'accessibilité des contenus pour tous les utilisateurs.",
      "Améliorer la lisibilité et la compréhension du contenu."
    ],
    "implementationIntro": "Utiliser les balises HTML appropriées plutôt que des caractères détournés.",
    "implementation": [
      "Utiliser les titres HTML (h1, h2, h3) au lieu d'astérisques ou points",
      "Utiliser les listes HTML au lieu de tirets ou numéros détournés",
      "Utiliser l'emphase HTML (strong, em) au lieu d'astérisques ou majuscules",
      "Utiliser CSS pour la mise en forme visuelle"
    ],
    "control": [
      "Vérifier que les titres utilisent les balises HTML appropriées.",
      "Vérifier qu'aucun caractère ne remplace une balise de sémantique.",
      "Vérifier la lisibilité du code source par les lecteurs d'écran."
    ],
    "screenshotsSources": ["", "", ""]
  },

  {
    "id": 58,
    "title": "Au moins deux moyens de paiement sont acceptés.",
    "authors": ["Romain Bourdot"],
    "path": "/rules/58",
    "description": "Certains internautes n’ont pas de chéquier, d’autres n’ont pas de carte de crédit ou bien leur carte de crédit a expiré. La présence d’un moyen de paiement alternatif permet de ne pas perdre ces clients.",
    "tags": ["Basics", "E-Commerce"],
    "objectives": [
      "Permettre aux utilisateurs de choisir le mode de paiement qui leur convient le mieux.",
      "Fournir une alternative en cas d'impossibilité d'utiliser un moyen de paiement précis."
    ],
    "implementationIntro": "Sur la page de paiement, proposez plusieurs options distinctes.",
    "implementation": [
      "Intégrer au moins deux types de paiement (ex: Carte Bancaire + PayPal).",
      "Afficher clairement les icônes des modes de paiement acceptés.",
      "Permettre le paiement par virement ou chèque si le paiement électronique échoue."
    ],
    "control": [
      "Simuler un achat jusqu'à l'étape du paiement.",
      "Vérifier la présence d'au moins deux options de règlement différentes."
    ],
    "screenshotsSources": ["https://www.decathlon.fr", "https://www.fnac.com"]
  },

  {
    "id": 59,
    "title": "Les données bancaires ne sont mémorisées qu'après consentement explicite de l'utilisateur",
    "authors": ["Romain Bourdot"],
    "path": "/rules/59",
    "description": "L'enregistrement des coordonnées bancaires pour des achats ultérieurs ne doit jamais être automatique. Il doit résulter d'une action volontaire (opt-in) de l'utilisateur.",
    "tags": [
      "Basics",
      "Accessibilité",
      "Développement",
      "E-Commerce",
      "Privacy"
    ],
    "objectives": [
      "Laisser l’utilisateur maître de ses choix en matière de mémorisation de données bancaires.",
      "Prévenir d’éventuels problèmes juridiques en cas de plainte ou de vol de données.",
      "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
    ],
    "implementationIntro": "Le consentement doit être recueilli de manière éclairée et active :",
    "implementation": [
      "Ne pas enregistrer automatiquement les données de paiement.",
      "Proposer une case à cocher (checkbox) non cochée par défaut pour la mémorisation.",
      "Informer l'utilisateur sur la finalité de cet enregistrement (ex: facilité pour les prochaines commandes)."
    ],
    "control": [
      "Simuler un processus de commande jusqu'au paiement.",
      "Vérifier que les données bancaires ne sont pas mémorisées par défaut.",
      "Vérifier que l'option d'enregistrement nécessite une validation explicite (opt-in)."
    ],
    "screenshotsSources": [
      "https://www.amazon.fr",
      "https://pay.google.com",
      "https://www.fnac.com"
    ]
  },

  {
    "id": 60,
    "title": "Les données bancaires mémorisées peuvent être modifiées ou supprimées",
    "authors": ["Romain Bourdot"],
    "path": "/rules/60",
    "description": "Les utilisateurs doivent pouvoir accéder à tout moment à la gestion de leurs moyens de paiement enregistrés pour les mettre à jour ou les supprimer définitivement.",
    "tags": ["Basics", "Développement", "E-Commerce", "Privacy"],
    "objectives": [
      "Prévenir les risques de fraude en permettant la suppression préventive des données.",
      "Donner aux utilisateurs la maîtrise de leurs données bancaires.",
      "Prévenir les erreurs de paiement en permettant la mise à jour des données expirées.",
      "Renforcer la confiance des utilisateurs."
    ],
    "implementationIntro": "Le site doit proposer un espace de gestion dédié dans le compte utilisateur :",
    "implementation": [
      "Créer une rubrique 'Moyens de paiement' dans l'espace client.",
      "Afficher la liste des cartes mémorisées (en masquant les numéros centraux).",
      "Proposer un bouton 'Supprimer' clair pour chaque moyen de paiement.",
      "Permettre la modification des informations (date d'expiration, nom)."
    ],
    "control": [
      "Se connecter à un compte client ayant une carte enregistrée.",
      "Vérifier qu'une option de suppression est présente et fonctionnelle.",
      "Vérifier qu'une option de modification est disponible."
    ],
    "screenshotsSources": [
      "https://www.amazon.fr/gp/css/homepage.html",
      "https://www.paypal.com/myaccount/money/",
      "https://www.netflix.com/YourAccount"
    ]
  },

  {
    "id": 61,
    "title": "La référence de la transaction est affichée au client après la validation de sa commande",
    "authors": ["Romain Bourdot"],
    "path": "/rules/61",
    "description": "Chaque transaction doit posséder un identifiant unique affiché dès la confirmation de l'achat pour permettre son suivi et servir de preuve en cas de réclamation.",
    "tags": ["Conception", "Développement", "E-Commerce"],
    "objectives": [
      "Permettre aux utilisateurs d’afficher et d’imprimer une trace de leur commande.",
      "Fournir aux utilisateurs une preuve écrite de l’opération effectuée.",
      "Renforcer la traçabilité de la transaction."
    ],
    "implementationIntro": "Dès que le paiement est validé, le site doit générer une vue de confirmation :",
    "implementation": [
      "Générer un numéro de commande ou de transaction unique.",
      "Afficher ce numéro de manière très visible sur la page de succès (Thank-you page).",
      "Préciser que ce numéro a également été envoyé par e-mail.",
      "Proposer un bouton d'impression de la page de confirmation."
    ],
    "control": [
      "Mener une procédure de commande complète jusqu'au paiement.",
      "Vérifier que la référence (ex: Commande n° FR-2024-849) apparaît sur la page finale."
    ],
    "screenshotsSources": [
      "https://www.apple.com/fr/shop/bag",
      "https://www.amazon.fr/gp/history",
      "https://www.fnac.com"
    ]
  },

  {
    "id": 62,
    "title": "Les factures émises sont également disponibles en ligne",
    "authors": ["Romain Bourdot"],
    "path": "/rules/62",
    "description": "Les factures sont des documents essentiels pour la gestion privée ou professionnelle. Le site doit permettre de les consulter et de les télécharger directement depuis l'espace client.",
    "tags": ["Basics", "Développement", "E-Commerce"],
    "objectives": [
      "Faciliter les opérations de gestion et de rapprochement par les utilisateurs.",
      "Fournir une sauvegarde des données nécessaires à la comptabilité.",
      "Éviter la perte d'informations en cas de suppression accidentelle d'un e-mail."
    ],
    "implementationIntro": "Le site doit centraliser les documents d'achat dans l'espace personnel :",
    "implementation": [
      "Créer une section 'Mes factures' ou 'Historique de commandes' dans le compte utilisateur.",
      "Générer les factures au format PDF pour garantir l'intégrité de la mise en page.",
      "Assurer la pérennité de l'accès (les factures doivent rester disponibles plusieurs années).",
      "Permettre le téléchargement en un clic."
    ],
    "control": [
      "Réaliser un achat sur le site.",
      "Se rendre dans l'espace client une fois la commande validée.",
      "Vérifier que la facture correspondante est présente et téléchargeable."
    ],
    "screenshotsSources": [
      "https://www.amazon.fr/gp/css/order-history",
      "https://www.ovhcloud.com/fr/billing/invoices/",
      "https://www.sfr.fr/espace-client/factures"
    ]
  },

  {
    "id": 63,
    "title": "Chaque facturation fait l'objet d'un mail de confirmation",
    "authors": ["Romain Bourdot"],
    "path": "/rules/63",
    "description": "L'envoi systématique de la facture par e-mail permet à l'utilisateur de conserver une trace de ses achats, indépendamment de la disponibilité future du site ou de son compte en ligne.",
    "tags": ["Basics", "Accessibilité", "Développement", "E-Commerce"],
    "objectives": [
      "Prévenir les pertes d’information et de factures en cas de fermeture de service.",
      "Améliorer la traçabilité des opérations pour l'utilisateur.",
      "Permettre une gestion documentaire autonome (archivage personnel)."
    ],
    "implementationIntro": "Le système de commande doit déclencher un envoi automatique :",
    "implementation": [
      "Configurer un serveur de mail (SMTP) lié au processus de validation de commande.",
      "Joindre la facture au format PDF ou inclure un lien de téléchargement direct et pérenne.",
      "S'assurer que l'objet du mail contient la référence de la commande pour faciliter la recherche.",
      "Inclure les informations légales (TVA, coordonnées du vendeur) dans le corps du mail."
    ],
    "control": [
      "Réaliser une commande test sur le site.",
      "Vérifier la réception immédiate d'un e-mail de confirmation.",
      "Vérifier que cet e-mail contient bien la facture ou un accès direct à celle-ci."
    ],
    "screenshotsSources": [
      "https://www.apple.com/fr/",
      "https://www.amazon.fr",
      "https://www.uber.com/fr/"
    ]
  },

  {
    "id": 64,
    "title": "Les mentions d'appartenance à un ordre ou groupe professionnel, d'un label ou d'une récompense sont accompagnées d'un lien vers la source",
    "authors": ["Romain Bourdot"],
    "path": "/rules/64",
    "description": "Si vous mentionnez des tiers valorisants (labels, récompenses, ordres professionnels), l’internaute doit pouvoir vérifier la crédibilité de ces informations via un lien vers la source officielle.",
    "tags": ["E-Commerce", "Éditorial", "Confiance"],
    "objectives": [
      "Donner un accès immédiat à l'utilisateur pour lui permettre de comprendre de quoi il s'agit.",
      "Permettre à l'utilisateur de vérifier par lui-même l'information.",
      "Accroître le degré de confiance ou de crédibilité du site."
    ],
    "implementationIntro": "Chaque logo ou mention de distinction doit être cliquable :",
    "implementation": [
      "Identifier tous les labels (Bio, Label Rouge, etc.) ou récompenses (Élu produit de l'année).",
      "Ajouter un lien hypertexte sur le logo ou le texte vers le site de l'organisme émetteur.",
      "Utiliser de préférence un lien ouvrant dans un nouvel onglet pour ne pas perdre l'utilisateur.",
      "Ajouter un attribut 'title' ou 'aria-label' pour expliciter la destination du lien."
    ],
    "control": [
      "Rechercher les logos de labels ou de récompenses sur le site (souvent en footer ou page à propos).",
      "Vérifier que chaque élément est bien accompagné d'un lien vers la source de référence."
    ],
    "screenshotsSources": [
      "https://www.opquast.com",
      "https://www.biocoop.fr",
      "https://www.tripadvisor.fr"
    ]
  },

  {
    "id": 87,
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/87",
    "description": "Il est toujours appréciable de connaître à l’avance le nombre d’étapes et de pouvoir estimer le temps nécessaire pour réaliser une longue démarche",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.). ",
      "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
    ],
    "implementationIntro": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
    "implementation": [],
    "control": [
      "Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    ],
    "screenshotsSources": []
  },
  {
    "id": 88,
    "title": "L'étape en cours d'un processus complexe est indiquée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/88",
    "description": "Ne vous êtes-vous jamais demandé, au beau milieu d’une démarche un peu longue répartie sur plusieurs formulaires successifs, où vous étiez exactement ?",
    "tags": ["Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
      "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
    ],
    "implementationIntro": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
    "implementation": [],
    "control": [
      "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée",
      "Dans le titre de page",
      "Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple « Étape 2 – Coordonnées » ou « Étape 4 – Paiement »."
    ],
    "screenshotsSources": []
  },
  {
    "id": 89,
    "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/89",
    "description": "Après avoir décidé de passer à l’étape suivante d’un processus complexe, il arrive souvent d’avoir besoin de vérifier ce qu’on a saisi précédemment. Laissez aux internautes la possibilité de douter, de vérifier, et de se tromper, bien sûr.",
    "tags": ["Accessibilité", "Développement", "Conception", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
    "implementation": [],
    "control": [
      "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    ],
    "screenshotsSources": []
  },
  {
    "id": 90,
    "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique de son navigateur dans un processus complexe.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/90",
    "description": "Ne vous est-il jamais arrivé de croire que vous pouviez tout simplement retourner voir ce que vous aviez saisi à l’étape précédente lors de votre déclaration d’impôts, par exemple, et de constater peu après que tout ce que vous aviez saisi avant ce remords était perdu ? Évitons ce genre de déception à nos utilisateurs.",
    "tags": [
      "Basics",
      "Accessibilité",
      "Conception",
      "Développement",
      "Formulaires"
    ],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité « back » de l’historique du navigateur. ",
    "implementation": [],
    "control": [
      "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton « back » du navigateur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 91,
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/91",
    "description": "Il est certes extrêmement confortable pour l’utilisateur de pouvoir naviguer dans les différentes étapes d’un processus complexe. Il est évidemment essentiel de l’avertir lorsque des données peuvent être perdues. C’est d’ailleurs l’objet d’une autre des règles assurance qualité web. Il est encore plus utile de s’assurer que l’ensemble des données saisies par l’utilisateur sont enregistrées à tout moment.",
    "tags": ["Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ],
    "implementationIntro": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étap",
    "implementation": [],
    "control": [
      "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite. "
    ],
    "screenshotsSources": []
  },
  {
    "id": 92,
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/92",
    "description": "Saisissez votre adresse e-mail. C’est bon, c’est fait ? Et si maintenant je vous demande de la saisir de nouveau, vous allez peut-être avoir la flemme de le faire et voudrez la copier depuis le premier champ pour la coller dans le deuxième. De quel droit certains sites voudraient-ils vous empêcher de faire cela ? Vive le copier-coller libre !",
    "tags": ["Basics", "Accessibilité", "Développement", "Formulaires"],
    "objectives": ["Faciliter la saisie dans les formulaires."],
    "implementationIntro": "",
    "implementation": [
      "Ne pas intercepter les événements JavaScript onpaste ou keydown pour bloquer le coller dans un champ de formulaire.",
      "Ne pas intercepter les événements JavaScript oncopy ou oncut pour bloquer le copier dans un champ de formulaire."
    ],
    "control": [
      "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).",
      "Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 93,
    "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/93",
    "description": "Le contenu de certaines listes déroulantes est suffisamment homogène pour se suffire à lui-même, mais, dans certains cas, la liste sera plus aisée à consulter en étant mieux organisée. Dans ce cas, l’élément optgroup est votre ami.",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
      "Améliorer l’accessibilité des contenus aux personnes handicapées"
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'élément optgroup pour baliser les regroupements thématiques d'éléments option dans les listes sel",
      "Utiliser l'attribut label de l'élément optgroup pour afficher l'étiquette de chaque regroupement."
    ],
    "control": [
      "Ouvrir chaque liste (select) pour détecter celles qui nécessiteraient un regroupement d'éléments option, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ",
      "Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments option qui devraient être regroupés est balisée avec l'élément optgroup",
      "Vérifier que chaque élément optgroup est doté d'un attribut label associant un libellé pertinent au groupe d'options concern"
    ],
    "screenshotsSources": []
  },
  {
    "id": 212,
    "title": "Un mécanisme de sécurité restreint l'origine des contenus.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/212",
    "description": "Le serveur envoie une page contenant divers éléments (fichiers JavaScript, CSS, webfonts, etc.) au navigateur, qui va se charger de télécharger et d’afficher le tout, le mieux et le plus vite possible… sans se poser de questions sur la légitimité de ce qu’il fait. Le système nommé Content Security Policy permet d’indiquer au navigateur des règles concernant l’origine de ces contenus. Cela permet de déterminer précisément ce qu’il aura le droit d’exécuter ou d’afficher, et cela renforce donc la sécurité pour les utilisateurs.",
    "tags": ["Basics", "Développement", "Sécurité"],
    "objectives": [
      "Réduire les risques d’exécution ou d’affichage d’un contenu non désirable ou d’une source non autorisée."
    ],
    "implementationIntro": "Activer l’en-tête HTTP Content-Security-Policy avec les directives CSP 1 appropriées :",
    "implementation": [
      "img-src pour les images ;",
      "script-src pour le JavaScript ;",
      "style-src pour les styles CSS ;",
      "font-src pour les webfonts ;",
      "etc."
    ],
    "control": [
      "Vérifier, à l'aide d'un outil d'inspection des en-têtes HTTP, la présence de l'en-tête Content-Security-Policy."
    ],
    "screenshotsSources": [
      "https://www.mozilla.org",
      "https://www.wikipedia.org"
    ]
  },
  {
    "id": 213,
    "title": "Le serveur ne communique pas d'informations sur les logiciels et langages utilisés.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/213",
    "description": "Les vrais informaticiens connaissent la vérité : il n’existe pas de logiciel ou d’outil informatique sécurisé à 100%. Chaque version de logiciel utilisé de manière importante -et c’est le cas de la plupart des logiciels serveurs, systèmes de gestion de contenus et même des formats utilisés sur le web présente un certain nombre de défauts. Utiliser telle ou telle version d’un logiciel peut aiguiller directement une personne mal intentionnée vers une faille de sécurité documentée. Votre serveur peut être configuré pour annoncer à tout le monde qu’il tourne avec la version X du logiciel Y. Ou alors, vous veillez à respecter cette règle et il sera muet comme un carpe.",
    "tags": ["Développement", "Sécurité"],
    "objectives": [
      "Prévenir les risques d’intrusion sur le serveur.",
      "Prévenir l’apparition de contenus ou scripts malveillants sur le site."
    ],
    "implementationIntro": "Ne communiquer via les entêtes HTTP envoyés par le serveur aucune information sur les logiciels et langages utilisés côté serveur, en particulier via les entêtes Server, X-Powered-By et X-AspNet-Version.",
    "implementation": [],
    "control": [
      "Vérifier que les les entêtes HTTP envoyés par le serveur ne donnent aucune information sur les logiciels et langages utilisés côté serveur."
    ],
    "screenshotsSources": ["https://www.google.com", "https://www.github.com"]
  },
  {
    "id": 214,
    "title": "Le contrôle d'intégrité des ressources tierces est présent et valide.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/214",
    "description": "Il est possible de vérifier que les ressources tierces (fichiers scripts, feuilles de style…) n’ont pas été modifiées pour y insérer du code malveillant. Pour ceci, le client web (navigateur, notamment) va vérifier en permanence que les fichiers envoyés sont les bons fichiers. Cette bonne pratique incite à la mise en place de cette mesure de sécurité.",
    "tags": ["Développement", "Sécurité"],
    "objectives": [
      "Prévenir les risques de diffusion de code malveillant.",
      "Limiter les risques associés à la diffusion de code malveillant : désindexation, plaintes, etc."
    ],
    "implementationIntro": "Utiliser l'attribut integrity de chaque élément link et script (appelant un fichier externe) pour fournir au navigateur le hachage cryptographique (hachage SRI) auquel le fichier doit correspondre.",
    "implementation": [],
    "control": [
      "Vérifier pour chaque élément link et script (appelant un fichier externe) la présence de l'attribut integrity indiquant le hachage cryptographique (hachage SRI) auquel le fichier concerné doit correspondre."
    ],
    "screenshotsSources": [
      "https://getbootstrap.com/docs",
      "https://www.cdnjs.com"
    ]
  },
  {
    "id": 215,
    "title": "Les opérations sécurisées peuvent être validées par au moins deux moyens.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/215",
    "description": "Le web étant ce qu’il est, les serveurs demandent de plus en plus souvent aux utilisateurs de valider certaines opérations en utilisant leur mobile, notamment. Il arrive cependant que les utilisateurs n’aient pas accès à leur mobile et ne soient donc pas en mesure de valider les opérations en question. C’est notamment le cas pour les personnes en déplacement à l’étranger. Pour éviter cela, proposez une solution de secours qui permettra tout de même de valider l’opération.",
    "tags": ["Conception", "Développement", "Sécurité"],
    "objectives": [
      "Prévenir les risques d’échec des opérations.",
      "Éviter l'exclusion d'utilisateurs pour des raisons techniques ou matérielles."
    ],
    "implementationIntro": "Pour toute opération sécurisée par un système de type authentification à double facteur ou autre authentification forte, fournir à l'utilisateur au moins deux mécanismes au choix pour l'utiliser (par exemple, authentification par SMS ou par terminal de validation).",
    "implementation": [],
    "control": [
      "Vérifier pour toute opération sécurisée par un système de type authentification à double facteur ou autre authentification forte, que l'utilisateur a le choix entre au moins deux mécanismes (par exemple, authentification par SMS ou par terminal de validation)."
    ],
    "screenshotsSources": [
      "https://github.com/settings/security",
      "https://myaccount.google.com/security"
    ]
  },
  {
    "id": 216,
    "title": "L'affichage de la barre d'adresse du navigateur n'est pas bloqué.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/216",
    "description": "Certains sites affichent les formulaires de connexion dans des fenêtres séparées, sans la barre d’adresse du navigateur. Ces fenêtres isolées, sans affichage de l'URL, peuvent être utilisées pour récupérer les identifiants de connexion, sans que les utilisateurs et utilisatrices aient de moyens de se rendre compte qu’ils ne sont pas sur le bon site (phishing). De manière générale, il est toujours utile de savoir sur quel site l’on se trouve.",
    "tags": ["Basics", "Conception", "Développement", "Sécurité"],
    "objectives": [
      "Limiter les risques d’interception d’identifiants et de mots de passe,",
      "Limiter les usurpations de domaines,",
      "Renforcer l’identification et la confiance en ligne."
    ],
    "implementationIntro": "Ne pas utiliser les techniques d'ouverture de popup permettant de masquer la barre d'adresse de la fenêtre. Par exemple, window.open() avec les options location= \"no\", toolbar=\"no\", fullscreen ou kiosk.",
    "implementation": [],
    "control": [
      "Vérifier pour chaque fenêtre ouverte la présence visible de la barre d'adresse du navigateur."
    ],
    "screenshotsSources": [
      "https://www.paypal.com",
      "https://www.bankofamerica.com"
    ]
  },
  {
    "id": 217,
    "title": "Le domaine de messagerie est authentifié",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/217",
    "description": "Les mails envoyés aux utilisateurs ont une importance capitale pour la qualité des expériences en ligne. Il faut donc veiller à ce que ceux-ci arrivent bien, ne partent pas en spam et que les serveurs de mails associés au site ou à l’application soient considérés comme de confiance sur toute la chaîne de transmission et de réception des mails. Pour cela, il est essentiel d’authentifier correctement le domaine de messagerie.",
    "tags": ["Basics", "Développement", "Sécurité"],
    "objectives": [
      "Protéger les utilisateurs contre les courriels frauduleux ou usurpés,",
      "Améliorer la délivrabilité des emails légitimes (newsletters, confirmations, alertes),",
      "Renforcer la réputation et la fiabilité du domaine émetteur,",
      "Réduire le risque que les emails soient classés comme spam,",
      "Respecter les exigences des principaux fournisseurs de messagerie,",
      "Surveiller les emails envoyés avec le nom de domaine."
    ],
    "implementationIntro": "Pour chaque domaine utilisé pour l'envoi d’emails :",
    "implementation": [
      "SPF : Ajouter un enregistrement TXT dans le DNS du domaine listant les serveurs autorisés à envoyer des mails pour ce domaine,",
      "DKIM : Configurer la signature cryptographique des emails émis via une clé privée, et publier la clé publique dans le DNS du domaine,",
      "DMARC : Définir une politique (none, quarantine, reject) et spécifier une adresse de retour pour les rapports, via un enregistrement DNS."
    ],
    "control": [
      "Pour chaque domaine utilisé pour l'envoi d'emails :",
      "Vérifier que les enregistrements SPF, DKIM et DMARC sont présents et correctement configurés,",
      "Analyser les en-têtes des e-mails reçus pour confirmer la bonne application des signatures,",
      "S'assurer que les politiques définies (notamment DMARC) sont cohérentes avec les pratiques d'envoi du site."
    ],
    "screenshotsSources": [
      "https://mxtoolbox.com/SuperTool.aspx",
      "https://github.com"
    ]
  },
  {
    "id": 218,
    "title": "L'adresse du site fonctionne avec et sans préfixe www.",
    "authors": ["Enzo ROSSI"],
    "path": "/rules/218",
    "description": "Lorsque l’on saisit directement des termes de format domaine.com, certains navigateurs transforment en https://www.domaine.com, d’autres en https://domaine.com Il arrive fréquemment que cette dernière adresse renvoie une erreur, même sur de très gros sites. Pensez-y.",
    "tags": ["Développement", "Serveurs et performances", "Écoconception"],
    "objectives": [
      "Permettre aux utilisateurs de rejoindre la page d'accueil du site même lorsqu'ils oublient de taper le préfixe www.",
      "Diminuer l'impact énergétique lié à la consultation du site"
    ],
    "implementationIntro": "Configurer le serveur de façon à ce qu'il gère les adresses sans www (acheminement).",
    "implementation": [],
    "control": [
      "Sur quelques unes des pages examinées :",
      "Enlever le préfixe «www» dans l'adresse de la page, au sein de la barre d'URL de votre navigateur",
      "Vérifier que vous avez toujours accès au site.",
      "Attention : certains navigateurs masquent par défaut le préfixe www. Le test devra donc se faire en ajoutant http:// ou https://devant l'adresse tout en omettant le préfixe, par exemple : https://opquast.com."
    ],
    "screenshotsSources": [
      "https://opquast.com",
      "https://www.opquast.com",
      "https://github.com"
    ]
  }
]
